// 1 day
// Написать:
// 	- бин поиск
// 	- свой map
// 	- рекурсивный setTimeout


// 2 day
// Написать:
// 	- quick sort
// 	- свой reduce
// 	- кеширующую функцию

// 3 day
// Написать:
// 	- сортировка пузырьком
// 	- свой bind (ES5 + ES6)
// 	- свой debounce
// базовый обход дерева в глубину

// 4 day
// Написать:
// 	- сортировка выбором
// 	- аналог Promise All
// 	- custom flatten

//  5 day
// Написать:
// 	- фибоначи рекурсия + цикл
// 	- факториал рекурсия + цикл
//  - performance timeout

// свой Math.random / Math.floor / Math.ceil (заебка с последней 9 !!)